import React, { useRef } from 'react';
import useStore from './useStore';
const oylar = ['январь', 'февраль', 'март', 'апрель', 'май', 'июнь', 'июль', 'август', 'сентябрь', 'октябрь', 'ноябрь', 'декабрь'];

function PrintSection({ printContentRef }) {
  const { rowsForPrint } = useStore();

  return (
    <div>
      <div style={{ display: 'none', position: 'absolute', top: '40%', left: '40%' }}>
        <div ref={printContentRef}>
          {rowsForPrint.map((row) => (
            <div className="page" key={row._id} style={{ fontSize: '16px', fontFamily: 'Cambria, serif' }}>
              <table>
                <tbody>
                  <tr>
                    <td style={{ display: 'flex', justifyContent: 'center' }}>
                      <img src="https://i.ibb.co/xFhyxpP/image001.png" alt="Gerb png" style={{}} />
                    </td>
                    <td></td>
                  </tr>
                  <tr style={{ verticalAlign: 'top' }}>
                    <td style={{ width: '50%', textAlign: 'center', paddingRight: 20 }}>
                      <p style={{ fontWeight: 'bold' }}>
                        ЎЗБEКИСТОН РEСПУБЛИКАСИ ПРОКУРАТУРАСИ САМАРҚАНД ВИЛОЯТ КАТТАҚЎРҒОН ТУМАН ПРОКУРАТУРАСИ
                      </p>
                      <p style={{ borderBottomStyle: 'double' }}>Каттақўрғон тумани, Пайшанба шаҳарчаси</p>
                      <p>
                        {new Date().getFullYear()} йил «{new Date().getDate()}» {oylar[new Date().getMonth()]}
                      </p>
                      <p>№ ______-25</p>
                    </td>
                    <td style={{ paddingLeft: 35 }}>
                      <p>
                        Фуқаролик ишлари бўйича Каттақўрғон туманлараро судининг раиси <b>З.У.Равшановга</b>
                      </p>
                      <p style={{ fontSize: '14px', textAlign: 'justify' }}>
                        <b>Ундирувчи</b> : Каттақўрғон туман прокурори, “ANVARJON BIZNES INVEST” МЧЖ Каттақўрғон туман филиалининг
                        манфаатини кўзлаб (Каттақўрғон тумани “Муллакўрпа” МФЙ, Чим к.к, МФО 01037, ИНН: 303421898, х/р
                        22604000105565269040, “ОРИЕНТ ФИНАНСБАНК” ХАТБ Тошкент шаҳар филиали)
                      </p>
                      <p style={{ textAlign: 'justify' }}>
                        Қарздор: {row.fio} (ЖШШИР: {row.pinfl}) Манзили: Каттақўрғон тумани {row.mfy_name} МФЙ, <br /> ШХР: {row.licshet}{' '}
                        <br />
                        Қарздорлик суммаси:{row.claimAmount.toLocaleString()} сўм
                        <br />
                        <b>{row.ariza_order_num}</b>
                      </p>
                    </td>
                  </tr>
                </tbody>
              </table>
              <h3 style={{ textAlign: 'center' }}>А Р И З А</h3>
              <p style={{ textAlign: 'center' }}>
                <i>(қарздорликни ундириш ҳақида)</i>
              </p>
              <div style={{ textAlign: 'justify', textIndent: 25 }}>
                <p>
                  Туман прокуратураси томонидан Ўзбекистон Республикаси Президентининг 22.11.2018 йилдаги ПФ-5580-сонли “Қаттиқ маиший
                  чиқиндиларни тўплаш ва олиб чиқиш учун тўловларни тулаш тизимини тубдан такомиллаштириш чора-тадбирлари тўғрисида”ги
                  Фармони ва 29.09.2020 йилдаги ПҚ-4845-сонли “Маиший ва қурилиш чиқиндилари билан боғлиқ ишларни бажариш тизимини янада
                  такомиллаштириш чора-тадбирлари тўғрисида”ги қарори ижроси юзасидан Каттақўрғон туманида жойлашган “ANVARJON BIZNES
                  INVEST” МЧЖ Каттақўрғон туман филиали фаолиятида ўтказилган таҳлил натижасида фуқаролар томонидан чиқинди пуллари
                  тўланмасдан келинганлиги аниқланган.
                </p>
                <p>
                  Аниқланишича, ундирувчи – “ANVARJON BIZNES INVEST” МЧЖ Каттақўрғон туман филиали ва {row.mfy_name} МФЙ ўртасида 2019 йил
                  01 январда “Жисмоний шахсларга маиший чиқиндиларни тўплаш ва олиб чиқиш учун хизматлар кўрсатиш бўйича” оммавий шартнома
                  тузилган бўлиб, қарздор {row.fio} мазкур шартномани тузиш тўғрисидаги оммавий таклиф (оферта)ни қабул қилган турар жой
                  мулкдори ҳисобланади.
                </p>
                <p>
                  Шартноманинг 4-бандига кўра Қарздор каттиқ ва суюқ маиший чиқиндиларни тўплаш ва олиб чиқиш бўйича кўрсатилган хизматлар
                  учун тўловларни ушбу шартномада белгиланган муддатларда ўз вақтида ва тўлиқ миқдорда тўлашга мажбур ҳисобланади.
                </p>
                <p>
                  Лекин, {row.warningDateString} йил ҳолатига кўра {row.fio} шартномада кўрсатилган ҳизматлар учун Ундирувчидан{' '}
                  {row.claimAmount.toLocaleString()} сўм қарздор бўлиб қолган.
                </p>
                <p>
                  Ундирувчи томонидан Қарздорга мавжуд қарздорликни тўлаш ҳақида бир неча маротаба оғзаки ва ёзма огоҳлантириш хати
                  берилганига қарамасдан, Қарздор шартномада белгиланган мажбуриятини бажармасдан келмоқда.
                </p>
                <p>
                  Ўзбекистон Республикаси ФПКнинг 171-моддасида суд буйруғини бериш бўйича талаблар кўрсатиб ўтилган бўлиб, мазкур модданинг
                  3-бандида коммунал хизматлар ёки алоқа хизматлари тўлови бўйича қазрдорликни тасдиқловчи ҳужжатларга асосланган ундириш
                  тўғрисида талаб арз қилинган бўлса суд буйруғи берилиши кўрсатилган.
                </p>
                <p>
                  Шу боис, Қарздор {row.fio} “ANVARJON BIZNES INVEST” МЧЖ Каттақўрғон туман филиали фойдасига{' '}
                  {row.claimAmount.toLocaleString()} сўм қарздорликни ундириш лозим бўлади.
                </p>
                <p>
                  Юқоридагиларга кўра, Ўзбекистон Республикаси “Прокуратура тўғрисида”ги Қонунининг 41-моддаси ва Ўзбекистон Республикаси
                  ФПКнинг 170-174-моддаларига асосан,
                </p>
              </div>
              <h3 style={{ textAlign: 'center' }}>С Ў Р А Й М А Н:</h3>
              <ol style={{ textAlign: 'justify' }}>
                <li>
                  Қарздор {row.fio} “ANVARJON BIZNES INVEST” МЧЖ Каттақўрғон туман филиали фойдасига {row.claimAmount.toLocaleString()} сўм
                  қарздорликни Каттақўрғон тумани учун очилган МФО 01037, ИНН: 303421898, х/р 22604000105565269040,“ОРИЕНТ ФИНАНСБАНК” ХАТБ
                  Тошкент шаҳар филиали транзит хисоб рақамга ундиришингизни.
                </li>
                <li>Тўланадиган давлат божини қарздор зиммасига юклашингизни.</li>
                <li>
                  Тўланган почта харажатларини МФО 01037, ИНН: 303421898, х/р 20208000900611603001 “Бизнесни Ривожлантириш банки” Тошкент ш.
                </li>
                <li>
                  Аризага мувофиқ чиқариладиган суд буйруғи нусҳасини туман прокуратураси ва “ANVARJON BIZNES INVEST” МЧЖ Каттақўрғон туман
                  филиалига юборишингизни.
                </li>
              </ol>
              <p>Илова: Ҳужжатлар _______ варақда.</p>
              <div style={{ display: 'flex', justifyContent: 'space-between', alignItems: 'flex-end' }}>
                <div style={{ width: 200 }}>
                  <b>Туман прокурори адлия маслаҳатчиси</b>
                </div>
                <div>
                  {' '}
                  <b>М.Х.Нозимов</b>
                </div>
              </div>
            </div>
          ))}
        </div>
      </div>
    </div>
  );
}

export default PrintSection;
